#pragma once

/// === 前方宣言 === ///
class DirectXCommon;

///=====================================================/// 
/// モデル基底クラス
///=====================================================///
class ModelCommon {

	///-------------------------------------------/// 
	/// メンバ関数
	///-------------------------------------------///
public:

	/// <summary>
	/// シングルトンインスタンスを取得
	/// </summary>
	/// <returns>インスタンス</returns>
	static ModelCommon* GetInstance();

	/// <summary>
	/// 初期化
	/// </summary>
	void Initialize();

	///-------------------------------------------/// 
	/// メンバ変数
	///-------------------------------------------///
private:

	//DirectX基底
	DirectXCommon* dxCommon_;

	///-------------------------------------------/// 
	/// ゲッター・セッター
	///-------------------------------------------///
public:

	DirectXCommon* GetDxCommon() const { return dxCommon_; }

};