#include "TankBullet.h"

using namespace MyEngine;

///=====================================================/// 
/// 弾が破棄される際に関連するコライダーを削除
///=====================================================///
TankBullet::~TankBullet() {

	//コライダーを削除
	collider_->Remove();
}

///=====================================================/// 
/// 弾を初期化し、パラメータを設定
///=====================================================///
void TankBullet::Initialize(Vector3 pos, Vector3 direction) {

	BulletBase::Initialize(pos, direction);
}

///=====================================================/// 
/// 弾の状態を更新
///=====================================================///
void TankBullet::Update() {

	BulletBase::Update();
}

///=====================================================/// 
/// 弾の座標更新処理を行う
///=====================================================///
void TankBullet::TransformUpdate() {

	BulletBase::TransformUpdate();
}

///=====================================================/// 
/// 弾の描画処理を行う
///=====================================================///
void TankBullet::Draw() {

	BulletBase::Draw();
}

///=====================================================/// 
/// 弾の移動処理を行う
///=====================================================///
void TankBullet::Move() {

	BulletBase::Move();
}

///=====================================================/// 
/// 他オブジェクトと接触している場合の処理を行う
///=====================================================///
void TankBullet::IsCollision() {

	//接触状態であれば
	if (collider_->GetIsTrigger()) {

		//接触相手のタグがENEMYであれば
		if (collider_->CheckHitTag(Collider::Tag::ENEMY)) {

			isDead_ = true;
		}
	}
}